micropython/micropython/stmhal/hal/l4/src/stm32l4xx_hal_sai.c
  /* Disable the SAI */
  SAI_Disable(hsai);

  /* Flush the fifo */
  SET_BIT(hsai->Instance->CR2, SAI_xCR2_FFLUSH);

  /* DeInit the low level hardware: GPIO, CLOCK, NVIC and DMA */
  HAL_SAI_MspDeInit(hsai);

  /* Initialize the error code */
  hsai->ErrorCode = HAL_SAI_ERROR_NONE;
  
  /* Initialize the SAI state */
  hsai->State = HAL_SAI_STATE_RESET;

  return HAL_OK;
}

/**
  * @brief Initialize the SAI MSP.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @retval None
  */
__weak void HAL_SAI_MspInit(SAI_HandleTypeDef *hsai)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsai);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_SAI_MspInit could be implemented in the user file
   */ 
}

/**
  * @brief DeInitialize the SAI MSP.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @retval None
  */
__weak void HAL_SAI_MspDeInit(SAI_HandleTypeDef *hsai)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsai);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_SAI_MspDeInit could be implemented in the user file
   */ 
}

/**
  * @}
  */

/** @defgroup SAI_Exported_Functions_Group2 IO operation functions 
 *  @brief   Data transfers functions 
 *
@verbatim   
  ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================  
    [..]
    This subsection provides a set of functions allowing to manage the SAI data 
    transfers.

    (+) There are two modes of transfer:
       (++) Blocking mode : The communication is performed in the polling mode. 
            The status of all data processing is returned by the same function 
            after finishing transfer.  
       (++) No-Blocking mode : The communication is performed using Interrupts 
            or DMA. These functions return the status of the transfer startup.
            The end of the data processing will be indicated through the 
            dedicated SAI IRQ when using Interrupt mode or the DMA IRQ when 
            using DMA mode.

    (+) Blocking mode functions are :
        (++) HAL_SAI_Transmit()
        (++) HAL_SAI_Receive()
        (++) HAL_SAI_TransmitReceive()
        
    (+) Non Blocking mode functions with Interrupt are :
        (++) HAL_SAI_Transmit_IT()
        (++) HAL_SAI_Receive_IT()
        (++) HAL_SAI_TransmitReceive_IT()

    (+) Non Blocking mode functions with DMA are :
        (++) HAL_SAI_Transmit_DMA()
        (++) HAL_SAI_Receive_DMA()
        (++) HAL_SAI_TransmitReceive_DMA()

    (+) A set of Transfer Complete Callbacks are provided in non Blocking mode:
        (++) HAL_SAI_TxCpltCallback()
        (++) HAL_SAI_RxCpltCallback()
        (++) HAL_SAI_ErrorCallback()

@endverbatim
  * @{
  */

/**
  * @brief  Transmit an amount of data in blocking mode.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @param  pData: Pointer to data buffer
  * @param  Size: Amount of data to be sent
  * @param  Timeout: Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_Transmit(SAI_HandleTypeDef *hsai, uint8_t* pData, uint16_t Size, uint32_t Timeout)
{
  uint32_t tickstart = HAL_GetTick();
  HAL_StatusTypeDef errorcode = HAL_OK;
  
  /* Process Locked */
  __HAL_LOCK(hsai);
  
  if((pData == NULL ) || (Size == 0)) 
  {
    errorcode = HAL_ERROR;
    goto error;
  }
  
  if(hsai->State != HAL_SAI_STATE_READY)
  {
    errorcode = HAL_BUSY;
    goto error;
  }
  
  hsai->State = HAL_SAI_STATE_BUSY_TX;
  hsai->ErrorCode = HAL_SAI_ERROR_NONE;
  hsai->XferSize = Size;
  hsai->XferCount = Size;
  hsai->pBuffPtr = pData;

  /* Check if the SAI is already enabled */ 
  if((hsai->Instance->CR1 & SAI_xCR1_SAIEN) == RESET)
  {
    /* fill the fifo with data before to enabled the SAI */
    SAI_FillFifo(hsai);
    /* Enable SAI peripheral */    
    __HAL_SAI_ENABLE(hsai);
  }

  while(hsai->XferCount > 0)
  { 
    /* Write data if the FIFO is not full */
    if((hsai->Instance->SR & SAI_xSR_FLVL) != SAI_FIFOSTATUS_FULL)
    {
      if((hsai->Init.DataSize == SAI_DATASIZE_8) && (hsai->Init.CompandingMode == SAI_NOCOMPANDING))
      {
        hsai->Instance->DR = (*hsai->pBuffPtr++);
      }
      else if(hsai->Init.DataSize <= SAI_DATASIZE_16)
      {
        *(uint16_t *)&hsai->Instance->DR = *((uint16_t *)hsai->pBuffPtr);
        hsai->pBuffPtr+= 2;
      }
      else
      {
        hsai->Instance->DR = *((uint32_t *)hsai->pBuffPtr);
        hsai->pBuffPtr+= 4;
      }
      hsai->XferCount--;
    }
    else
    {
      /* Check for the Timeout */
      if((Timeout != HAL_MAX_DELAY) && ((Timeout == 0)||((HAL_GetTick() - tickstart ) > Timeout)))
      {
        errorcode = HAL_TIMEOUT;
        goto error;
      }
    }
  }

  hsai->State = HAL_SAI_STATE_READY;
    
error :
  /* Process Unlocked */
  __HAL_UNLOCK(hsai);
  return errorcode;
}
  
/**
  * @brief  Receive an amount of data in blocking mode. 
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @param  pData: Pointer to data buffer
  * @param  Size: Amount of data to be received
  * @param  Timeout: Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_Receive(SAI_HandleTypeDef *hsai, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
  uint32_t tickstart = HAL_GetTick();
  HAL_StatusTypeDef errorcode = HAL_OK;
  
  /* Process Locked */
  __HAL_LOCK(hsai);
  
  if((pData == NULL ) || (Size == 0)) 
  {
    errorcode = HAL_ERROR;
    goto error;
  }
  
  if(hsai->State != HAL_SAI_STATE_READY)
  { 
    errorcode = HAL_BUSY;
    goto error;
  }
  
  hsai->pBuffPtr = pData;
  hsai->XferSize = Size;
  hsai->XferCount = Size;
  hsai->State = HAL_SAI_STATE_BUSY_RX;
  hsai->ErrorCode = HAL_SAI_ERROR_NONE;
  
  /* Check if the SAI is already enabled */ 
  if((hsai->Instance->CR1 & SAI_xCR1_SAIEN) == RESET)
  {
    /* Enable SAI peripheral */    
    __HAL_SAI_ENABLE(hsai);
  }
  
   /* Receive data */
  do
  { 
    /* Wait until RXNE flag is set */
    if((hsai->Instance->SR & SAI_xSR_FLVL) != SAI_FIFOSTATUS_EMPTY)
    {
      if((hsai->Init.DataSize == SAI_DATASIZE_8) && (hsai->Init.CompandingMode == SAI_NOCOMPANDING))
      {
        (*hsai->pBuffPtr++) = hsai->Instance->DR;
      }
      else if(hsai->Init.DataSize <= SAI_DATASIZE_16)
      {
        *((uint16_t*)hsai->pBuffPtr) = hsai->Instance->DR;
        hsai->pBuffPtr+= 2;
      }
      else
      {
        *((uint32_t*)hsai->pBuffPtr) = hsai->Instance->DR;
        hsai->pBuffPtr+= 4;
      }  
      hsai->XferCount--; 
    }
    else
    {
      /* Check for the Timeout */
      if((Timeout != HAL_MAX_DELAY) && ((Timeout == 0)||((HAL_GetTick() - tickstart ) > Timeout)))
      {
        errorcode = HAL_TIMEOUT;
        goto error;
      }
    }
  }
  while(0 != hsai->XferCount);
  hsai->State = HAL_SAI_STATE_READY;
    
error : 
  /* Process Unlocked */
  __HAL_UNLOCK(hsai);
  return errorcode;
}

/**
  * @brief  Transmit an amount of data in non-blocking mode with Interrupt.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @param  pData: Pointer to data buffer
  * @param  Size: Amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_Transmit_IT(SAI_HandleTypeDef *hsai, uint8_t *pData, uint16_t Size)
{
  HAL_StatusTypeDef errorcode = HAL_OK;
  
  /* Process Locked */
  __HAL_LOCK(hsai);  
  
  if((pData == NULL) || (Size == 0)) 
  {
    errorcode = HAL_ERROR;
    goto error;
  }
  
