micropython/micropython/stmhal/hal/l4/src/stm32l4xx_hal_sai.c
  if(hsai->State != HAL_SAI_STATE_READY)
  {
    errorcode = HAL_BUSY;
    goto error;
  }
  
  hsai->pBuffPtr = pData;
  hsai->XferSize = Size;
  hsai->XferCount = Size;
  hsai->ErrorCode = HAL_SAI_ERROR_NONE;
  hsai->State = HAL_SAI_STATE_BUSY_TX;
  if((hsai->Init.DataSize == SAI_DATASIZE_8) && (hsai->Init.CompandingMode == SAI_NOCOMPANDING))
  {
    hsai->InterruptServiceRoutine = SAI_Transmit_IT8Bit;
  }
  else if(hsai->Init.DataSize <= SAI_DATASIZE_16)
  {
    hsai->InterruptServiceRoutine = SAI_Transmit_IT16Bit;
  }
  else
  {
    hsai->InterruptServiceRoutine = SAI_Transmit_IT32Bit;
  }
  
  /* Fill the fifo before starting the communication */
  SAI_FillFifo(hsai);

  /* Enable FRQ and OVRUDR interrupts */
  __HAL_SAI_ENABLE_IT(hsai, SAI_InterruptFlag(hsai, SAI_MODE_IT));
  
  /* Check if the SAI is already enabled */ 
  if((hsai->Instance->CR1 & SAI_xCR1_SAIEN) == RESET)
  {
    /* Enable SAI peripheral */    
    __HAL_SAI_ENABLE(hsai);
  }
  
error :
  /* Process Unlocked */
  __HAL_UNLOCK(hsai);
  return errorcode;
}

/**
  * @brief  Receive an amount of data in non-blocking mode with Interrupt.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @param  pData: Pointer to data buffer
  * @param  Size: Amount of data to be received
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_Receive_IT(SAI_HandleTypeDef *hsai, uint8_t *pData, uint16_t Size)
{
  HAL_StatusTypeDef errorcode = HAL_OK;
  
  /* Process Locked */
  __HAL_LOCK(hsai);
  
  if((pData == NULL) || (Size == 0)) 
  {
    errorcode =  HAL_ERROR;
    goto error;
  }
  
  if(hsai->State != HAL_SAI_STATE_READY)
  {
    errorcode = HAL_BUSY;
    goto error;
  }
  
  hsai->pBuffPtr = pData;
  hsai->XferSize = Size;
  hsai->XferCount = Size;
  hsai->ErrorCode = HAL_SAI_ERROR_NONE;
  hsai->State = HAL_SAI_STATE_BUSY_RX;
  if((hsai->Init.DataSize == SAI_DATASIZE_8) && (hsai->Init.CompandingMode == SAI_NOCOMPANDING))
  {
    hsai->InterruptServiceRoutine = SAI_Receive_IT8Bit;
  }
  else if(hsai->Init.DataSize <= SAI_DATASIZE_16)
  {
    hsai->InterruptServiceRoutine = SAI_Receive_IT16Bit;
  }
  else
  {
    hsai->InterruptServiceRoutine = SAI_Receive_IT32Bit;
  }
  
  /* Enable the interrupts */
  __HAL_SAI_ENABLE_IT(hsai, SAI_InterruptFlag(hsai, SAI_MODE_IT));
  
  /* Check if the SAI is already enabled */ 
  if((hsai->Instance->CR1 & SAI_xCR1_SAIEN) == RESET)
  {
    /* Enable SAI peripheral */
    __HAL_SAI_ENABLE(hsai);
  }
  
error :
  /* Process Unlocked */
  __HAL_UNLOCK(hsai);
  return errorcode;
}

/**
  * @brief Pause the audio stream playing from the Media.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_DMAPause(SAI_HandleTypeDef *hsai)
{
  /* Process Locked */
  __HAL_LOCK(hsai);
  
  /* Pause the audio file playing by disabling the SAI DMA requests */
  hsai->Instance->CR1 &= ~SAI_xCR1_DMAEN;

  /* Process Unlocked */
  __HAL_UNLOCK(hsai);
  
  return HAL_OK; 
}

/**
  * @brief Resume the audio stream playing from the Media.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_DMAResume(SAI_HandleTypeDef *hsai)
{
  /* Process Locked */
  __HAL_LOCK(hsai);
  
  /* Enable the SAI DMA requests */
  hsai->Instance->CR1 |= SAI_xCR1_DMAEN;

  /* If the SAI peripheral is still not enabled, enable it */
  if ((hsai->Instance->CR1 & SAI_xCR1_SAIEN) == RESET)
  {
    /* Enable SAI peripheral */    
    __HAL_SAI_ENABLE(hsai);
  }

  /* Process Unlocked */
  __HAL_UNLOCK(hsai);
  
  return HAL_OK;
}

/**
  * @brief Stop the audio stream playing from the Media.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_DMAStop(SAI_HandleTypeDef *hsai)
{
  HAL_StatusTypeDef errorcode = HAL_OK;

  /* Process Locked */
  __HAL_LOCK(hsai);
  
  /* Disable the SAI DMA request */
  hsai->Instance->CR1 &= ~SAI_xCR1_DMAEN;
  
  /* Abort the SAI DMA Channel */
  if(hsai->hdmatx != NULL)
  {
    if(HAL_DMA_Abort(hsai->hdmatx) != HAL_OK)
    {
      errorcode = HAL_ERROR;
      goto error;
    }
  }

  if(hsai->hdmarx != NULL)
  {
    if(HAL_DMA_Abort(hsai->hdmarx) != HAL_OK)
    {
      errorcode = HAL_ERROR;
      goto error;
    }
  }
  
  /* Disable SAI peripheral */
  SAI_Disable(hsai);
  
  hsai->State = HAL_SAI_STATE_READY;
  
error :
  /* Process Unlocked */
  __HAL_UNLOCK(hsai);
  
  return errorcode;
}

/**
  * @brief Abort the current transfer and disable the SAI.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_Abort(SAI_HandleTypeDef *hsai)
{
  HAL_StatusTypeDef errorcode = HAL_OK;

  /* Disable the SAI DMA request */
  hsai->Instance->CR1 &= ~SAI_xCR1_DMAEN;
  
  /* Abort the SAI DMA Channel */
  if(hsai->hdmatx != NULL)
  {
    if(HAL_DMA_Abort(hsai->hdmatx) != HAL_OK)
    {
      errorcode = HAL_ERROR;
      goto error;
    }
  }
  
  if(hsai->hdmarx != NULL)
  {
    if(HAL_DMA_Abort(hsai->hdmarx) != HAL_OK)
    {
      errorcode = HAL_ERROR;
      goto error;
    }
  }
  
  /* Disabled All interrupt and clear all the flag */
  hsai->Instance->IMR = 0;
  hsai->Instance->CLRFR = 0xFFFFFFFF;
  
  /* Disable SAI peripheral */
  SAI_Disable(hsai);
  
  /* Flush the fifo */
  SET_BIT(hsai->Instance->CR2, SAI_xCR2_FFLUSH);
  
  hsai->State = HAL_SAI_STATE_READY;
  
error :
  /* Process Unlocked */
  __HAL_UNLOCK(hsai);
  
  return errorcode;
}

/**
  * @brief  Transmit an amount of data in non-blocking mode with DMA.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @param  pData: Pointer to data buffer
  * @param  Size: Amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_Transmit_DMA(SAI_HandleTypeDef *hsai, uint8_t *pData, uint16_t Size)
{
  HAL_StatusTypeDef errorcode = HAL_OK;
  
  /* Process Locked */
  __HAL_LOCK(hsai);
  
  if((pData == NULL) || (Size == 0)) 
  {
    errorcode = HAL_ERROR;
    goto error;
  }
  
