micropython/micropython/stmhal/hal/l4/src/stm32l4xx_hal_sai.c
  if(hsai->State != HAL_SAI_STATE_READY)
  {
    errorcode = HAL_BUSY;
    goto error;  
  }
  
  hsai->pBuffPtr = pData;
  hsai->XferSize = Size;
  hsai->XferCount = Size;
  hsai->ErrorCode = HAL_SAI_ERROR_NONE;
  hsai->State = HAL_SAI_STATE_BUSY_TX;
  
  /* Set the SAI Tx DMA Half transfer complete callback */
  hsai->hdmatx->XferHalfCpltCallback = SAI_DMATxHalfCplt;
  
  /* Set the SAI TxDMA transfer complete callback */
  hsai->hdmatx->XferCpltCallback = SAI_DMATxCplt;
  
  /* Set the DMA error callback */
  hsai->hdmatx->XferErrorCallback = SAI_DMAError;
  
  /* Enable the Tx DMA Channel */
  if(HAL_DMA_Start_IT(hsai->hdmatx, (uint32_t)hsai->pBuffPtr, (uint32_t)&hsai->Instance->DR, hsai->XferSize) != HAL_OK)
  {
    errorcode = HAL_ERROR;
    goto error;  
  }
  
  /* Check if the SAI is already enabled */ 
  if((hsai->Instance->CR1 & SAI_xCR1_SAIEN) == RESET)
  {
    /* Enable SAI peripheral */
    __HAL_SAI_ENABLE(hsai);
  }
  
  /* Enable the interrupts for error handling */
  __HAL_SAI_ENABLE_IT(hsai, SAI_InterruptFlag(hsai, SAI_MODE_DMA));
  
  /* Enable SAI Tx DMA Request */  
  hsai->Instance->CR1 |= SAI_xCR1_DMAEN;
  
error :     
  /* Process Unlocked */
  __HAL_UNLOCK(hsai);
  return errorcode;
}

/**
  * @brief  Receive an amount of data in non-blocking mode with DMA. 
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @param  pData: Pointer to data buffer
  * @param  Size: Amount of data to be received
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_Receive_DMA(SAI_HandleTypeDef *hsai, uint8_t *pData, uint16_t Size)
{
  HAL_StatusTypeDef errorcode = HAL_OK;
  
  /* Process Locked */
  __HAL_LOCK(hsai);
  
  if((pData == NULL) || (Size == 0))
  {
    errorcode = HAL_ERROR;
    goto error;
  } 
  
  if(hsai->State != HAL_SAI_STATE_READY)
  {    
    errorcode = HAL_BUSY;
    goto error;
  }
  hsai->pBuffPtr = pData;
  hsai->XferSize = Size;
  hsai->XferCount = Size;
  hsai->ErrorCode = HAL_SAI_ERROR_NONE; 
  hsai->State = HAL_SAI_STATE_BUSY_RX;
  
  /* Set the SAI Rx DMA Half transfer complete callback */
  hsai->hdmarx->XferHalfCpltCallback = SAI_DMARxHalfCplt;
  
  /* Set the SAI Rx DMA transfer complete callback */
  hsai->hdmarx->XferCpltCallback = SAI_DMARxCplt;
  
  /* Set the DMA error callback */
  hsai->hdmarx->XferErrorCallback = SAI_DMAError;
  
  /* Enable the Rx DMA Channel */
  if(HAL_DMA_Start_IT(hsai->hdmarx, (uint32_t)&hsai->Instance->DR, (uint32_t)hsai->pBuffPtr, hsai->XferSize) != HAL_OK)
  {    
    errorcode = HAL_ERROR;
    goto error;
  }
  
  /* Check if the SAI is already enabled */
  if((hsai->Instance->CR1 & SAI_xCR1_SAIEN) == RESET)
  {
    /* Enable SAI peripheral */
    __HAL_SAI_ENABLE(hsai);
  }
  
  /* Enable the interrupts for error handling */
  __HAL_SAI_ENABLE_IT(hsai, SAI_InterruptFlag(hsai, SAI_MODE_DMA));
    
  /* Enable SAI Rx DMA Request */
  hsai->Instance->CR1 |= SAI_xCR1_DMAEN;
  
error :     
  /* Process Unlocked */
  __HAL_UNLOCK(hsai);
  return errorcode;
}

/**
  * @brief  Enable the Tx mute mode.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @param  val:  value sent during the mute @ref SAI_Block_Mute_Value
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_EnableTxMuteMode(SAI_HandleTypeDef *hsai, uint16_t val)
{
  assert_param(IS_SAI_BLOCK_MUTE_VALUE(val));
  
  if(hsai->State != HAL_SAI_STATE_RESET)
  {
    CLEAR_BIT(hsai->Instance->CR2, SAI_xCR2_MUTEVAL | SAI_xCR2_MUTE);
    SET_BIT(hsai->Instance->CR2, SAI_xCR2_MUTE | val);
    return HAL_OK;
  }
  return HAL_ERROR;
}

/**
  * @brief  Disable the Tx mute mode.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_DisableTxMuteMode(SAI_HandleTypeDef *hsai)
{
  if(hsai->State != HAL_SAI_STATE_RESET)
  {
    CLEAR_BIT(hsai->Instance->CR2, SAI_xCR2_MUTEVAL | SAI_xCR2_MUTE);
    return HAL_OK;
  }
  return HAL_ERROR;
}

/**
  * @brief  Enable the Rx mute detection.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @param  callback: function called when the mute is detected
  * @param  counter: number a data before mute detection max 63.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_EnableRxMuteMode(SAI_HandleTypeDef *hsai, SAIcallback callback, uint16_t counter)
{
  assert_param(IS_SAI_BLOCK_MUTE_COUNTER(counter));
  
  if(hsai->State != HAL_SAI_STATE_RESET)
  {
    /* set the mute counter */
    CLEAR_BIT(hsai->Instance->CR2, SAI_xCR2_MUTECNT);
    SET_BIT(hsai->Instance->CR2, (counter << SAI_xCR2_MUTECNT_OFFSET));
    hsai->mutecallback = callback;
    /* enable the IT interrupt */
    __HAL_SAI_ENABLE_IT(hsai, SAI_IT_MUTEDET);
    return HAL_OK;
  }
  return HAL_ERROR;
}

/**
  * @brief  Disable the Rx mute detection.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SAI_DisableRxMuteMode(SAI_HandleTypeDef *hsai)
{
  if(hsai->State != HAL_SAI_STATE_RESET)
  {
    /* set the mutecallback to NULL */
    hsai->mutecallback = (SAIcallback)NULL;
    /* enable the IT interrupt */
    __HAL_SAI_DISABLE_IT(hsai, SAI_IT_MUTEDET);
    return HAL_OK;
  }
  return HAL_ERROR;
}

/**
  * @brief  Handle SAI interrupt request.
  * @param  hsai: pointer to a SAI_HandleTypeDef structure that contains
  *                the configuration information for SAI module.
  * @retval None
  */
void HAL_SAI_IRQHandler(SAI_HandleTypeDef *hsai)
{ 
  if(hsai->State != HAL_SAI_STATE_RESET)
  {
    __IO uint32_t tmpFlag = hsai->Instance->SR;
    __IO uint32_t tmpItSource = hsai->Instance->IMR; 
    
    if(((tmpFlag & SAI_xSR_FREQ) == SAI_xSR_FREQ) && ((tmpItSource & SAI_IT_FREQ) == SAI_IT_FREQ))
    {
      hsai->InterruptServiceRoutine(hsai);
      goto exit;
    }
    
    /* check the flag only if one of them is set */
    if(tmpFlag != 0x00000000)
    {
      /* SAI Overrun error interrupt occurred ----------------------------------*/
      if(((tmpFlag & SAI_FLAG_OVRUDR) == SAI_FLAG_OVRUDR) && ((tmpItSource & SAI_IT_OVRUDR) == SAI_IT_OVRUDR))
      {
        /* Clear the SAI Overrun flag */
        __HAL_SAI_CLEAR_FLAG(hsai, SAI_FLAG_OVRUDR);
        /* Change the SAI error code */
        hsai->ErrorCode = ((hsai->State == HAL_SAI_STATE_BUSY_RX) ? HAL_SAI_ERROR_OVR : HAL_SAI_ERROR_UDR);
        /* the transfer is not stopped, we will forward the information to the user and we let the user decide what needs to be done */
        HAL_SAI_ErrorCallback(hsai);
        goto exit;
      }
      
      /* SAI mutedet interrupt occurred ----------------------------------*/
      if(((tmpFlag & SAI_FLAG_MUTEDET) == SAI_FLAG_MUTEDET) && ((tmpItSource & SAI_IT_MUTEDET) == SAI_IT_MUTEDET))
      {
        /* Clear the SAI mutedet flag */
        __HAL_SAI_CLEAR_FLAG(hsai, SAI_FLAG_MUTEDET);
        /* call the call back function */
        if(hsai->mutecallback != (SAIcallback)NULL)
        {
          /* inform the user that an RX mute event has been detected */
          hsai->mutecallback();
        }
        goto exit;
      }
      
